{"meta":{"title":"与戈尔巴乔夫握手的老徐","subtitle":"莫见乎隐  莫显乎微  君子慎独","description":"就在这分享自己的思考","author":"徐疯狂","url":"http://xudafeng.xyz"},"pages":[{"title":"徐疯狂的个人简介","date":"2019-02-03T09:51:44.000Z","updated":"2019-02-17T13:44:24.164Z","comments":true,"path":"about/index.html","permalink":"http://xudafeng.xyz/about/index.html","excerpt":"","text":"据我母亲说，小时候我就是个调皮捣蛋的孩子，十分喜欢亲近大自然，区别于别的小伙伴的腼腆和害羞，我则是活泼外向的，也是整条街上的孩子王，这可能也就形成了自己爱交流喜欢冒险的个性。因为喜欢新奇的想法，本科就选了工业设计这个专业，没想到从本科到研究生竟然坚持了7年的时间，从理论到实践才一步一步的有了自己对于设计的看法，还是喜欢这种天马行空创意无限的感觉，那种从无到有的创作过程是十分美妙的。下面放点自己的小作品，有些手绘是夏天给考研手绘班代课的时候画的。 我这个人用我周围朋友的话来说那就是，十分“无聊”的，他们经常问我的问题就是，你不玩游戏也不看电视剧和综艺节目那你的时间都去哪了呢？对啊，我的时间都去哪了呢，我想了想都去了这些地方，平时喜欢看书看的也很杂，特别是一些名人传记比较感兴趣；再有就是锻炼身体，健身有五年了，游泳和玩各种球类都占据了我的时间；还有就是喜欢吃点美食；其实我也看电视剧和电影，比如昆汀的电影，周星驰的电影我能看十遍，时间充足的话我也会看些美剧，其他爱好还有很多我就不一一枚举了。总之我还算是一个很有趣的人吧，不然也不会有这么多人喜欢我，哈哈哈。 以上就是关于我的一份十分不严谨的自我介绍，刚开始写博客希望各位看客多多支持，也可以关注我的微信公众号，任何意见都可以在公众号中给我留言，谢谢大家啦！"},{"title":"categories","date":"2019-02-03T09:51:31.000Z","updated":"2019-02-13T16:06:50.314Z","comments":true,"path":"categories/index.html","permalink":"http://xudafeng.xyz/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2019-02-03T09:51:04.000Z","updated":"2019-02-03T13:14:37.154Z","comments":true,"path":"tags/index.html","permalink":"http://xudafeng.xyz/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"硅谷没有钢铁侠有的只是一位钢铁直男","slug":"2019-2-18","date":"2019-02-17T16:00:00.000Z","updated":"2019-02-18T07:44:05.217Z","comments":true,"path":"2019/02/18/2019-2-18/","link":"","permalink":"http://xudafeng.xyz/2019/02/18/2019-2-18/","excerpt":"","text":"硅谷没有钢铁侠有的只是一位钢铁直男 本篇文章是针对《硅谷钢铁侠 埃隆马斯克的冒险人生》这本书所展开的 说实话在读这本书之前提到马斯克的名字，我脑海里面出现的一些感性词汇会是特斯拉、太空、火星，可以说是相当的模糊。虽然说对于这个人名如雷贯耳但对于他的事迹，我却了解的不是很系统。读完之后我对马斯克有了新的认识，那就是“钢铁直男”。这真的不是贬义，我对马斯克十分钦佩和欣赏，为什么说是“钢铁直男”，且听我细细道来。 马斯克家族在南非的历史上可以一直追溯到200年前，富有的南非白人，家里还有黑人“管家”。他的外祖父十分能够能折腾，酷爱冒险和飞行，曾经有一次从南非自驾一路飞到了挪威，其中他的外祖母还没有驾驶执照，我的天哪，三万英里飞行历程往返澳大利亚，而且还是带着全家去飞行，我滴妈呀，这是冒险还是作死，最神奇的是这老俩口都是神枪手，还赢得过全国射击比赛。这样的成长环境或多或少的形成了马斯克性格中喜欢冒险和孤注一掷的精神。再说下主人公马斯克，这家伙少年就是个神童啊。这本书最大的特点就是马斯克口述的很少，更多的信息来源于马斯克身边人的陈述，有点疑问就是这里面是不是有些水分，例如成功之后来自他人的有意夸张和谄媚。不管怎么样，都能看出他确实有很强的记忆力以及阅读能力，喜欢思考问题这就很了不起，要知道马斯克说把人类在宇宙中的征程看作是个人使命的时候才十五岁。但据他身边的同学回忆他的成绩也不是很突出，班里同学也都对他没啥印象，对他以后能有如此成就成为亿万富翁很是惊讶。 最喜欢的一部分还是马斯克创业初期每天敲代码的那段日子，困了就睡在睡袋里面，这和扎克伯格很相似，facebook在初期也是十分艰苦的，没日没夜的工作看来使每位大佬成功之前的必经之路，可能是因为热爱吧！有点好奇的是他在1995年就有了类似于黄页的概念，最终的想法是做成像今天大众点评或者yelp这类的东西，看来最容易赚钱的还是tob啊，Zip2有时间我要好好了解一下。&gt; 我具有武士精神，我宁愿切腹，也不要失败。还有一段就是当zip2获得投资的时候，公司有了起色，开始招募真正的程序员的时候，这些程序员要来改写马斯克这个半路出家得程序员所编写的代码，马斯克十分气愤，经常半夜再找时间改回来，哈哈哈。。。有一点疑问就是他创建的公司和他所学的专业半毛钱关系都没有，他在宾大是学的沃顿商学院和物理硕士学位，对于超级电容器，新能源从很小就有兴趣，这也和他创建的公司没关系，这是为什么？有一点没变得就是他对于自己相信的事情的投入以及坚定。他在加拿大求学时期的教授就是这样评价他的：他将复杂的物理概念与商业计划相结合的能力。不仅如此，他还显示出了将一项科研成果转化为营利性企业的非凡才能。 这个就是我们说的商业头脑和嗅觉了吧，这可能跟他的实习经历有关系，1995年就开始断言传统金融行业要向互联网金融转移，建立金融服务机构，这个想法相当超前和大胆，注册就送现金卡20刀推荐给朋友使用就送10刀，这种营销推广手段现在都很流行（参考支付宝），利用电子邮箱进行转账。这就是初期的X.com，到后期和paypal合并，牛逼啊啊。。。。当时如果董事会对马斯克再耐心一点估计之后就没有支付宝了。 大众已经丧失了对于未来的雄心和希望,要重振美国人的探索精神 马斯克从zip2到X.com公司，董事会始终不认可他，觉他不是一个CEO的合适人选，马斯克到底适不适合当ceo？有一个例子就是在space的时候，在对外宣传时，马斯克总是说猎鹰火箭是自己设计的，这让那些埋头苦干的工程师很不爽，在火箭研发阶段他还找来了很多纪录片制作人来跟拍自己，这一度让公司员工认为他们的CEO被成功冲昏头脑了。我觉得适合，任何事物都是有两面性的，更不用说一个人或者说一个成功的人，他当然会有自己的个性，比如说很难接触或者是变换方法的压榨员工等等，但是考验一个人到底适不适合带领一个团队的不是在顺境中的表现而是在逆境中的对策。仅就这本书所展示的部分来看，马斯克是屈指可数的具有极强抗压能力的人，一个很深刻的例子就是2008年全球金融危机，特斯拉和space x都面临着资金问题，马斯克当时已经把全部身家都投入到了这两家公司里面去，而且当时马斯克面对的是spacex接连的发射失败，马斯克在这两个项目开始时拥有两亿美金，可是将近两年过去了这两个项目完全要从头开始，特斯拉要从头开始roadster项目，而space x还有很多人住在夸贾林环礁上等待“猎鹰一号”的下一次发射，事实是马斯克已经没有资金继续投入了。屋漏偏遭连阴雨，就在这个时候他和他的第一任妻子贾斯汀的婚姻也走到了尽头，这下连住地下室的机会也没有了，贾斯汀获得房产以及200万美元的现金以及一辆特斯拉roadster。这时候的马斯克真的是孤注一掷啊，每周工作七天基本上所有时间都是处理这些让人棘手的问题，佩服！就在全硅谷甚至全世界都在看马斯克失败的笑话时，space x的猎鹰火箭在第四次发射时成功了，要知道这500人是每天住在小岛上花了将近六年的时间才创造了这个奇迹啊。凭借着这次发射成功，space x最终获得了来自NASA的订单，有了这笔钱公司终于能暂时松一口气了。马斯克剑走偏锋他告诉投资人可以向space x 公司4000万美元来完成融资，并且呼吁投资人也拿出相当的资金为特斯拉注资。当时马斯克只剩下几十万美元了，甚至无法给员工们开出第二天的薪水，可最后这一招奏效了，马斯克最终为这轮融资贡献了1200万美元，剩下的部分由投资公司提供。经过这些，我们看到的是一个赤手空拳来到美国打拼、失去了一个孩子、被记者和前妻在媒体上狠狠羞辱、用尽毕生心血的公司处于倒闭边缘的男人。压力越大他就做得越好，所以说我想，没有其他人比马斯克更适合做特斯拉和space x的CEO了。 人类应该成为一种跨行星物种 马斯克的远见、抗压能力、工作效率绝对算的上是一个超级英雄——钢铁侠，但是他在待人接物上面却是一个十足的钢铁直男，书中有很多例子在说马斯克在管理公司和员工的时候的点点滴滴，不如说是吐槽，例如，如果某个员工跟马斯克直接抱怨或者诉说某项任务太过苛刻无法完成或者无法按照给定的时间完成那得到的答案就是你可以不用来上班了，并且不论是谁无论是什么岗位马斯克都会把对方的工作直接接管，神奇的是还能自己解决，2014年初，他开除了贝思布朗，一位忠诚的行政助理。包括上文中写到的他会在深夜将公司顶尖程序员的代码按照自己的逻辑和认知进行修改，这些点点滴滴我觉得都不是坏事，这才构成了一个有血有肉的钢铁侠，反而会觉得马斯克很可爱。这种直我想，是对事不对人的直，是重振全人类的探索精神的直，是不达目的誓不罢休的直。让人敬佩！","categories":[{"name":"杂记","slug":"杂记","permalink":"http://xudafeng.xyz/categories/杂记/"}],"tags":[]},{"title":"Hexo个人博客插入图片问题","slug":"2019-2-17","date":"2019-02-16T16:00:00.000Z","updated":"2019-02-17T14:23:41.804Z","comments":true,"path":"2019/02/17/2019-2-17/","link":"","permalink":"http://xudafeng.xyz/2019/02/17/2019-2-17/","excerpt":"","text":"Hexo博客插入图片问题 该篇文章以next主题为例 在搭建完博客并且顺利开始写文章之后你突然发现，咦？好像还缺少点什么，如果我要给自己的文章插入图片的话应该怎么办？别急这篇文章就告诉你我在博客中插入图片时碰到的坑。。。 其实hexo官网已经对这些问题进行了描述，这里我先放上这篇说明的链接 下面以插入本地图片为例：1. 首先就是配置站点信息文件 config 找到它然后将 post_asset_folder: false 改为 true。2. 其次是安装一个插件 npm install https://github.com/CodeFalling/hexo-asset-image – save，在hexo下运行 git here，输入上述操作命令进行安装，基本不会报错，可能会提示你更新，按照git的提示操作即可。3. 关键的一步那就是把你要插入的图片存放在 public/images 文件当中！存放在public/images文件当中！存放在public/images文件当中！说三遍。4. 更为关键的一步，也是我自己出错的一步就是markdown语法千万不要写错，这里以插入本地图片为例 ![要插入的图片描述]（/images/插入图片名.jpg）如果是url那么将url替换小括号里面的路径即可。 以上就是我在插入图片是所走过的一些弯路，我就插入一张我的手绘图片来做个例子吧，希望可以帮助到大家，也欢迎大家在公众号中与我交流！","categories":[{"name":"编程","slug":"编程","permalink":"http://xudafeng.xyz/categories/编程/"}],"tags":[]},{"title":"编程也许是一种修身养性的爱好","slug":"2019-2-16","date":"2019-02-15T16:00:00.000Z","updated":"2019-02-16T14:24:36.250Z","comments":true,"path":"2019/02/16/2019-2-16/","link":"","permalink":"http://xudafeng.xyz/2019/02/16/2019-2-16/","excerpt":"","text":"编程也许是一种修身养性的爱好 编程如果作为一种兴趣爱好的话，可以磨炼一个人的耐性！ 程序员朋友们看到我这个说法肯定会diss我的，哈哈哈，比如你每天对着这些代码工作到凌晨你会修身养性？你会心情舒畅？当然不会 ！我指的是首先这个事情是出于自己的兴趣，内心就想要去干的事情。比如拿我自己举例子，类似于写个博客啊，编写一些个小游戏啦等等。其次，工作量不是特别大而且工期随性。在这样的前提下，学习编程或许确实可以修炼一个人的性格。 你在摸索的过程中出现的任何错误，其他人早已出现过了。 首先作为一个技术小白，自己最初对于编程的认知仅仅停留在C语言上，当然我认知里面的c语言就是一个代名词，是什么完全不了解。随着成长，由于专业的原因，身边也没有任何从事计算机行业的同学（最近五年有了很多）所接触到和所认识到的跟计算机相差甚远。回想起来自己第一次接触编程是在2017年，通过看书了解到写博客有很多的益处，才开始有了想要靠自己搭建一个个人博客的想法，现在想起来这个想法都是十分的疯狂。要知道对于当时的我来说搭建一个博客的工作量并没有什么认知，有了这个想法之后我就开始在网上搜索关于搭建个人博客的具体步骤。现在总结看来有个好习惯很重要，那就是先制定计划，遇到困难就问google。你在摸索的过程中出现的任何错误，其他人早已出现过，先不放弃，实在解决不了的就先放一放，休息会再继续。 GitHub + Hexo + markdown 让我第一次接触到了编程 具体的搭建过程我就不赘述了，个人认为对小白来说最不友好的就是域名解析那一部分，以及将github与你自己购买的域名进行关联这一环，我个人是在这里花了一些时间。其他部分各种小坑不断，当然只要会用互联网那就肯定能搜到很多相关教程，我发现，在学一个东西的时候最让人担心的不是这个东西有多么的难，而是怕没有一个“好老师”教。这里的“老师”指的是书籍、网络以及该领域的专家等等，举个例子比如说你要学习java，那么你可以买很多关于java教学的书，或者找到很多关于java学习的视频，但是最耗时间的就是跟着这本书学习了一段时间后，发现这本书的“套路”不适合你，当然在学习的过程当中总会要走些弯路的，也就是甄别这些“老师”所花费的时间，所以尽量少走弯路就是高效率的体现。还有一个问题就是虽然你会搜到很多教程但是当你仔细比较的时候会发现，很多教程都是复制粘贴的或者是当时讲到的一些解决方法已经失效了，这时就需要不断地试错才能最终找到问题的解决方案。要知道在搭建个人博客的过程当中我是花了将近一个月的（白天实习，晚上回到寝室看教程写代码，上海四十读的高温寝室当时还没有空调。。。），网上所有说只需多少小时就可以搞定的文章，我觉得都不是写给零基础的小白的。在这个过程当中真的是收获很多，虽然没有完全理解编程（你当然可以说这不是编程，但对于小白来说这真的就是了），但是给我的印象就是严谨，另一个印象就是它真的很讲究规矩啊。当博客搭建成功第一篇测试文章发布成功的时候，当时激动地心情溢于言表，但两个月后我的电脑出了问题，重装系统后一切清零。。。。 其实学的就是一个游戏规则或者说规范 直到2018年1月份我决定从事互联网行业，才开始或者说真正意义上接触到了编程。事情是这样的 ，我作为一个互联网的小白，在2018年互联网的冬天有了两端b端产品经理的实习经历，当时的boss是某第三方支付团队过来的行业老前辈，我作为一个新人自然是有机会就向他请教（后续我会整理出来他对于产品的一些理解），其中就谈到了自己的劣势可能就是对于计算机编程一窍不通，在业务上或多或少会遇到很多问题。他的建议是学一门编程语言自己感受一下，他说的三个月就会学会，我信了！之后我开始了一边实习一边学编程的日子，几个星期后我开始有点入门了，不得不说python确实是简洁好上手啊，经过几个星期的学习自己可以编写一些小游戏自娱自乐了。后来自己才发现其实学的就是一个游戏规则或者说规范，按照这个规范来编写程序就可以跑起来，出了任何错误它就会卡壳等你去修复它，就这样自己断断续续的在学python，包括现在正在研究的爬虫（当然我学python就为了这个,目的性很明确）,学习的过程中始终给我的感觉就是简洁、规范、严谨。 错误是有原因的而且是可以解决的 直到现在我又开始了自己个人博客的搭建以及优化，我发现我之所以一年多没继续的原因就是嫌麻烦，另一个原因就是自己心里预设它很难，其实只要你开始写第一行代码，你就会发现其实没有想象中的那样困难。。。而且我逐渐发现如果说单纯的把写代码看作是一个兴趣和爱好的话，我指的不是独立完成一个项目的工作，其实编程是比较磨炼一个人的耐心的，如果你没有耐心的话，那么在某一行代码出错的时候你就会很急躁，而不是停下来去自己核对把错误纠正，反复的出错中我学到的就是，计算机不会出错，错肯定在某个地方：不是拼写错误可能就是格式错误等等，肯定是有原因，而且也肯定是有办法解决的。真的是很锻炼人的耐心，我是一个容易急躁的人（某些人认为吧），在摸索的过程当中出现的一个接一个的错误让我养成了根据提示进行检查比对的好习惯。","categories":[{"name":"编程","slug":"编程","permalink":"http://xudafeng.xyz/categories/编程/"}],"tags":[]},{"title":"Hexo个人博客文章长度显示设置","slug":"2019-2-16(2)","date":"2019-02-15T16:00:00.000Z","updated":"2019-02-16T14:25:40.870Z","comments":true,"path":"2019/02/16/2019-2-16(2)/","link":"","permalink":"http://xudafeng.xyz/2019/02/16/2019-2-16(2)/","excerpt":"","text":"Hexo个人博客文章长度显示设置 站点配置文件：Hexo文件下的config；主题配置文件：themes文件下的config 本篇文章以next主题为例，首先找到主题配置文件，双击打开后在左侧搜索框内搜索 Automatically Excerpt ，将 auto_excerpt 下的 enable 所对应的 false 改为 true 即可，下面的 length 为长度设置，可以手动设置文章显示的字符数。 修改过后 再次进入hexo，按照流程 hexo clean hexo g hexo d 这样文章就会按照我们设置的长度显示，在没有点开的情况下文章显示“阅读全文”，点击后进入正文。","categories":[{"name":"编程","slug":"编程","permalink":"http://xudafeng.xyz/categories/编程/"}],"tags":[]},{"title":"新的开始！","slug":"2019-2-3","date":"2019-02-03T08:19:26.968Z","updated":"2019-02-13T16:11:46.593Z","comments":true,"path":"2019/02/03/2019-2-3/","link":"","permalink":"http://xudafeng.xyz/2019/02/03/2019-2-3/","excerpt":"","text":"测试 这是一篇测试文章，看到这篇文章说明自2017-9-2之后，我的个人博客又开始了更新，之前的内容已经被清空，现在让我们开始吧！","categories":[{"name":"测试","slug":"测试","permalink":"http://xudafeng.xyz/categories/测试/"}],"tags":[]},{"title":"终生学习者","slug":"hello-world","date":"2019-02-01T15:01:23.560Z","updated":"2019-02-04T00:58:36.206Z","comments":true,"path":"2019/02/01/hello-world/","link":"","permalink":"http://xudafeng.xyz/2019/02/01/hello-world/","excerpt":"","text":"Welcome to 终生学习者! This is your very first post. Check 微信 for more info. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy","categories":[],"tags":[]}]}