{"meta":{"title":"与戈尔巴乔夫握手的老徐","subtitle":"莫见乎隐  莫显乎微  君子慎独","description":"就在这分享自己的思考","author":"徐疯狂","url":"xudafeng.xyz"},"pages":[{"title":"tags","date":"2019-02-03T09:51:04.000Z","updated":"2019-02-03T13:14:37.154Z","comments":true,"path":"tags/index.html","permalink":"xudafeng.xyz/tags/index.html","excerpt":"","text":""},{"title":"徐疯狂的个人简介","date":"2019-02-03T09:51:44.000Z","updated":"2019-02-16T06:28:00.109Z","comments":true,"path":"about/index.html","permalink":"xudafeng.xyz/about/index.html","excerpt":"","text":"据我母亲说，小时候我就是个调皮捣蛋的孩子，十分喜欢亲近大自然，区别于别的小伙伴的腼腆和害羞，我则是活泼外向的，也是整条街上的孩子王，这可能也就形成了自己爱交流喜欢冒险的个性。因为喜欢新奇的想法，本科就选了工业设计这个专业，没想到从本科到研究生竟然坚持了7年的时间，从理论到实践才一步一步的有了自己对于设计的看法，还是喜欢这种天马行空创意无限的感觉，那种从无到有的创作过程是十分美妙的。下面放点自己的小作品，有些手绘是夏天给考研手绘班代课的时候画的。 我这个人用我周围朋友的话来说那就是，十分“无聊”的，他们经常问我的问题就是，你不玩游戏也不看电视剧和综艺节目那你的时间都去哪了呢？对啊，我的时间都去哪了呢，我想了想都去了这些地方，平时喜欢看书看的也很杂，特别是一些名人传记比较感兴趣；再有就是锻炼身体，健身有五年了，游泳和玩各种球类都占据了我的时间；还有就是喜欢吃点美食；其实我也看电视剧和电影，比如昆汀的电影，周星驰的电影我能看十遍，时间充足的话我也会看些美剧，其他爱好还有很多我就不一一枚举了。总之我还算是一个很有趣的人吧，不然也不会有这么多人喜欢我，哈哈哈。 以上就是关于我的一份十分不严谨的自我介绍，刚开始写博客希望各位看客多多支持，也可以关注我的微信公众号，任何意见都可以在公众号中给我留言，谢谢大家啦！"},{"title":"categories","date":"2019-02-03T09:51:31.000Z","updated":"2019-02-13T16:06:50.314Z","comments":true,"path":"categories/index.html","permalink":"xudafeng.xyz/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"编程也许是一种修身养性的爱好","slug":"2019-2-16","date":"2019-02-15T16:00:00.000Z","updated":"2019-02-16T14:00:57.117Z","comments":true,"path":"2019/02/16/2019-2-16/","link":"","permalink":"xudafeng.xyz/2019/02/16/2019-2-16/","excerpt":"","text":"编程也许是一种修身养性的爱好 编程如果作为一种兴趣爱好的话，可以磨炼一个人的耐性！ 程序员朋友们看到我这个说法肯定会diss我的，哈哈哈，比如你每天对着这些代码工作到凌晨你会修身养性？你会心情舒畅？当然不会 ！我指的是首先这个事情是出于自己的兴趣，内心就想要去干的事情。比如拿我自己举例子，类似于写个博客啊，编写一些个小游戏啦等等。其次，工作量不是特别大而且工期随性。在这样的前提下，学习编程或许确实可以修炼一个人的性格。 你在摸索的过程中出现的任何错误，其他人早已出现过了。 首先作为一个技术小白，自己最初对于编程的认知仅仅停留在C语言上，当然我认知里面的c语言就是一个代名词，是什么完全不了解。随着成长，由于专业的原因，身边也没有任何从事计算机行业的同学（最近五年有了很多）所接触到和所认识到的跟计算机相差甚远。回想起来自己第一次接触编程是在2017年，通过看书了解到写博客有很多的益处，才开始有了想要靠自己搭建一个个人博客的想法，现在想起来这个想法都是十分的疯狂。要知道对于当时的我来说搭建一个博客的工作量并没有什么认知，有了这个想法之后我就开始在网上搜索关于搭建个人博客的具体步骤。现在总结看来有个好习惯很重要，那就是先制定计划，遇到困难就问google。你在摸索的过程中出现的任何错误，其他人早已出现过，先不放弃，实在解决不了的就先放一放，休息会再继续。 GitHub + Hexo + markdown 让我第一次接触到了编程 具体的搭建过程我就不赘述了，个人认为对小白来说最不友好的就是域名解析那一部分，以及将github与你自己购买的域名进行关联这一环，我个人是在这里花了一些时间。其他部分各种小坑不断，当然只要会用互联网那就肯定能搜到很多相关教程，我发现，在学一个东西的时候最让人担心的不是这个东西有多么的难，而是怕没有一个“好老师”教。这里的“老师”指的是书籍、网络以及该领域的专家等等，举个例子比如说你要学习java，那么你可以买很多关于java教学的书，或者找到很多关于java学习的视频，但是最耗时间的就是跟着这本书学习了一段时间后，发现这本书的“套路”不适合你，当然在学习的过程当中总会要走些弯路的，也就是甄别这些“老师”所花费的时间，所以尽量少走弯路就是高效率的体现。还有一个问题就是虽然你会搜到很多教程但是当你仔细比较的时候会发现，很多教程都是复制粘贴的或者是当时讲到的一些解决方法已经失效了，这时就需要不断地试错才能最终找到问题的解决方案。要知道在搭建个人博客的过程当中我是花了将近一个月的（白天实习，晚上回到寝室看教程写代码，上海四十读的高温寝室当时还没有空调。。。），网上所有说只需多少小时就可以搞定的文章，我觉得都不是写给零基础的小白的。在这个过程当中真的是收获很多，虽然没有完全理解编程（你当然可以说这不是编程，但对于小白来说这真的就是了），但是给我的印象就是严谨，另一个印象就是它真的很讲究规矩啊。当博客搭建成功第一篇测试文章发布成功的时候，当时激动地心情溢于言表，但两个月后我的电脑出了问题，重装系统后一切清零。。。。 其实学的就是一个游戏规则或者说规范 直到2018年1月份我决定从事互联网行业，才开始或者说真正意义上接触到了编程。事情是这样的 ，我作为一个互联网的小白，在2018年互联网的冬天有了两端b端产品经理的实习经历，当时的boss是某第三方支付团队过来的行业老前辈，我作为一个新人自然是有机会就向他请教（后续我会整理出来他对于产品的一些理解），其中就谈到了自己的劣势可能就是对于计算机编程一窍不通，在业务上或多或少会遇到很多问题。他的建议是学一门编程语言自己感受一下，他说的三个月就会学会，我信了！之后我开始了一边实习一边学编程的日子，几个星期后我开始有点入门了，不得不说python确实是简洁好上手啊，经过几个星期的学习自己可以编写一些小游戏自娱自乐了。后来自己才发现其实学的就是一个游戏规则或者说规范，按照这个规范来编写程序就可以跑起来，出了任何错误它就会卡壳等你去修复它，就这样自己断断续续的在学python，包括现在正在研究的爬虫（当然我学python就为了这个,目的性很明确）,学习的过程中始终给我的感觉就是简洁、规范、严谨。 错误是有原因的而且是可以解决的 直到现在我又开始了自己个人博客的搭建以及优化，我发现我之所以一年多没继续的原因就是嫌麻烦，另一个原因就是自己心里预设它很难，其实只要你开始写第一行代码，你就会发现其实没有想象中的那样困难。。。而且我逐渐发现如果说单纯的把写代码看作是一个兴趣和爱好的话，我指的不是独立完成一个项目的工作，其实编程是比较磨炼一个人的耐心的，如果你没有耐心的话，那么在某一行代码出错的时候你就会很急躁，而不是停下来去自己核对把错误纠正，反复的出错中我学到的就是，计算机不会出错，错肯定在某个地方：不是拼写错误可能就是格式错误等等，肯定是有原因，而且也肯定是有办法解决的。真的是很锻炼人的耐心，我是一个容易急躁的人（某些人认为吧），在摸索的过程当中出现的一个接一个的错误让我养成了根据提示进行检查比对的好习惯。","categories":[{"name":"编程","slug":"编程","permalink":"xudafeng.xyz/categories/编程/"}],"tags":[]},{"title":"新的开始！","slug":"2019-2-3","date":"2019-02-03T08:19:26.968Z","updated":"2019-02-13T16:11:46.593Z","comments":true,"path":"2019/02/03/2019-2-3/","link":"","permalink":"xudafeng.xyz/2019/02/03/2019-2-3/","excerpt":"","text":"测试 这是一篇测试文章，看到这篇文章说明自2017-9-2之后，我的个人博客又开始了更新，之前的内容已经被清空，现在让我们开始吧！","categories":[{"name":"测试","slug":"测试","permalink":"xudafeng.xyz/categories/测试/"}],"tags":[]},{"title":"终生学习者","slug":"hello-world","date":"2019-02-01T15:01:23.560Z","updated":"2019-02-04T00:58:36.206Z","comments":true,"path":"2019/02/01/hello-world/","link":"","permalink":"xudafeng.xyz/2019/02/01/hello-world/","excerpt":"","text":"Welcome to 终生学习者! This is your very first post. Check 微信 for more info. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy","categories":[],"tags":[]}]}